{
    "langs": [
        {
            "name": "Python",
            "level": "Advanced",
            "icon": "/icons/python-plain.svg",
            "text": "This is the language that I have the most affinity and knowledge about, I have been studying Python since 2016 more specifically on the web part with Django, Flask and FastAPI along with WebSockets for the development of APIs and Sites, in addition I use Python to create scripts for automation of basic routines such as Tasks, API data fetchers and among other uses"
        },
        {
            "name": "Node.js",
            "level": "Advanced",
            "icon": "/icons/nodejs-plain.svg",
            "text": "Although NodeJS is not a language I will fit it here because of the improvements it brings to JavaScript, in any project that needs a good dependency/package management and that also needs asynchronicity and speed is usually where I believe NodeJS shines. I see this since 2018 when I create my project in Vue"
        },
        {
            "name": "Golang",
            "level": "Intermediate",
            "icon": "/icons/go-plain.svg",
            "text": "When I want something extremely performant, there's no doubt I'll choose Go, in fact one of the best languages ever created, designed for speed, I started having contact with Go in early 2020 and I like to use it to create microservices and simple APIs"
        },
        {
            "name": "Dart",
            "level": "Intermediate",
            "icon": "/icons/dart-original.svg",
            "text": "Dart is one of the languages I use more for the framework it has than for the language itself, even so I consider this a good language for OOP, As I said I met Dart through Flutter in 2019 and so far I use it together with Flutter to create my mobile apps"
        },
        {
            "name": "CSS",
            "level": "Advanced",
            "icon": "/icons/css3-plain.svg",
            "text": "In the web part everything is better with a good style and a good animation, here's the CSS for that. I like it precisely because it brings websites to life by making people feel comfortable using a visually pleasing website."
        },
        {
            "name": "HTML",
            "level": "Advanced",
            "icon": "/icons/html5-plain.svg",
            "text": "HTML is basic to any web page, so a good structure will lead to an excellent page."
        },
        {
            "name": "JavaScript",
            "level": "Advanced",
            "icon": "/icons/javascript-plain.svg",
            "text": "Today, in any corner of the Web, JS is used because of this fact it is an almost mandatory language for anyone who works with the Web, so since 2017 I have been studying and working with it to create sites both in backend and frotend using JS"
        },
        {
            "name": "TypeScript",
            "level": "Intermediate",
            "icon": "/icons/typescript-plain.svg",
            "text": "From 2019 I started to work with TypeScript, the typing that is proposed makes it much easier to understand the functions and architecture of the system in addition to standardizing what is being done which ends up resulting in easier understanding, normally I am using TypeScript more than than JavaScript in my project precisely because of these improvements"
        }
    ],
    "frameworks": [
        {
            "name": "Django",
            "level": "Advanced",
            "icon": "/icons/django-plain.svg",
            "text": "This is in fact the framework I like the most, the versatility and simplicity of the code written in it makes it simple and easy to understand, in addition to the fact that it is possible to do a lot with just a few lines of code thanks to the reuse it provides. Apart from that the speed and practicality of configuring and installing Django is surreal"
        },
        {
            "name": "Flutter",
            "level": "Advanced",
            "icon": "/icons/flutter-plain.svg",
            "text": "Since March 2019, when I met Flutter, it has become my favorite for creating and developing apps for iOS and Android, it ends up being my favorite because of the fluidity of the animations, the ease of writing the code and the easy application of the guiding concepts. to the object"
        },
        {
            "name": "Gin",
            "level": "Intermediate",
            "icon": "/icons/gin.svg",
            "text": "as I mentioned in Golang, which I choose to use Golang for processes that demand performance, when it needs to be turned to the Web, Gin will be my tool of the time, since 2021 I started working with Gin, the performance delivered, usually I use it together with Websockets and photo processing"
        },
        {
            "name": "Vue",
            "level": "Advanced",
            "icon": "/icons/vuejs-original.svg",
            "text": "This is the front-end framework that I use the most in my frontend projects, because of its simplicity and performance in writing the code, but besides, with Vue it's easy and fast to apply it"
        },
        {
            "name": "Next.js",
            "level": "Intermediate",
            "icon": "/icons/nextjs-original.svg",
            "text": "This is the newest framework I learned (I started at the end of 2020), the practicality and simplicity of the code with NextJs + React is surreal, and the way static content is managed/generated is an innovative and unique way. Today in my React projects, NextJs cannot be missing."
        },
        {
            "name": "React",
            "level": "Intermediate",
            "icon": "/icons/react-original.svg",
            "text": "At the beginning of 2020 I started using React in business projects, and I applied it to some personal projects as well, and after that I realized that this was an excellent framework for creating a well-structured modern front-end environment thanks to JSX"
        },
        {
            "name": "Nuxt",
            "level": "Advanced",
            "icon": "/icons/nuxt.svg",
            "text": "Nuxt is like a Vue++ (in reference to C++), whenever I need to use the store, routing, folder organization Nuxt has this to help me in projects with Vue, most of my projects I use Nuxt to big improvement it adds to Vue, I study it since 2019 practically together with Vue"
        },
        {
            "name": "Express",
            "level": "Intermediate",
            "icon": "/icons/express-original.svg",
            "text": "When I need an API that has asynchronicity and resistance to failures, I often choose Express, in addition it can handle a large number of requests and deliver them quickly, besides it is simple and easy to use Express to start an API"
        },
        {
            "name": "Sass",
            "level": "Advanced",
            "icon": "/icons/sass-original.svg",
            "text": "I really like SASS because of its speed in creating a style for a website, but other than that, I also like the compression and syntax in which the code is written, in addition to the implementation of functions to the standard CSS like mixins, use, import and the like, which improve the way to create a style"
        },
        {
            "name": "Swift",
            "level": "Beginner",
            "icon": "/icons/swift-plain.svg",
            "text": "I started studying Swift together with SwiftUI at the end of 2020, just like Flutter, SwiftUI is an excellent framework for creating apps, but for iOS, it is extremely fluid in its animation and thanks to swift it's very simple and easy learn, the Vupy app is being made with SwiftUI when launching it will be my first project so stay tuned"
        }
    ],
    "databases": [
        {
            "name": "PostgreSQL",
            "level": "Advanced",
            "icon": "/icons/postgresql-plain.svg",
            "text": "In fact, the relational database I like to use the most, the consistency of the data storage in my opinion surpasses that of MySQL, in addition to being faster, more practical and optimized to use. I've always used it with Django it makes an excellent junction almost every project I have that uses relational databases PostgreSQL is present at least from 2018 onwards"
        },
        {
            "name": "MySQL",
            "level": "Intermediate",
            "icon": "/icons/mysql-plain.svg",
            "text": "MySQL (My sequel) was the first bank I contacted at the end of 2017 when I was in technical school. For simple projects I usually prefer to use it, however for larger projects I prefer others. But its version compatible with AWS Aurora is in fact very performatic and resilient"
        },
        {
            "name": "Redis",
            "level": "Intermediate",
            "icon": "/icons/redis.svg",
            "text": "It is impossible today to have an online bank without a cache layer, I see Redis as a guardian of the main bank applying a sophisticated and highly performatic cache layer that helps when collecting the same data, in addition to passing information to other simple systems way without needing a complex architecture"
        },
        {
            "name": "MongoDB",
            "level": "Beginner",
            "icon": "/icons/mongoDB.svg",
            "text": "When I want to do something that uses NoSQL and that has a behavior similar to PostgreSQL and that needs to have a malleable structure with elastic scalability (clusters), MongoDB fits right into this need, for the simple fact that its storage in JSON documents facilitates both the search and the the meltability"
        },
        {
            "name": "Cassandra",
            "level": "Beginner",
            "icon": "/icons/cassandra.svg",
            "text": "This is the least I know about I've been studying it since 2020, in fact it's a very performant bank for high volumes of data insertion and selection, I still don't have a project with it, feel free to give me an idea"
        }
    ],
    "tools": [
        {
            "name": "Git",
            "level": "Advanced",
            "icon": "/icons/git-plain.svg",
            "text": "Git today is the basics of any project, it is necessary to have versioning, control the actions of programmers within the project and the like. Luckily we have Git for all of that."
        },
        {
            "name": "Docker",
            "level": "Intermediate",
            "icon": "/icons/docker-plain-wordmark.svg",
            "text": "As Docker makes everything easier, having the possibility to isolate the raw dependencies (languages, banks, simple infrastructure) of the projects in a mini virtual machine so that it can run on any machine regardless of the OS on it is sensational, I've been working with docker since mid-2019 and today about 80% (practically all private) of my projects contain docker"
        },
        {
            "name": "AWS",
            "level": "Intermediate",
            "icon": "/icons/amazonwebservices-original.svg",
            "text": "Scalability, monitoring, security, modernity, resources, cloud computing and among others everything on AWS, knowing AWS today is knowing how to effectively provide an API with basic security and provide resources for it, Today I know some AWS services such as EC2, ECS , ECR, SQS, RDS (Aurora), S3, CloudWatch, WAF Shield, and the like"
        },
        {
            "name": "Nginx",
            "level": "Intermediate",
            "icon": "/icons/nginx-original.svg",
            "text": "To link a domain to an API, website, microservice, etc., Nginx is an excellent tool, with it I can release endpoints and serve my web applications without major problems."
        },
        {
            "name": "Figma",
            "level": "Intermediate",
            "icon": "/icons/figma-plain.svg",
            "text": "The projects that involve screens, interface images and the like, figma is my silver bullet, I can prototype them to get a preview of how each part will look, including this portfolio was prototyped in Figma, I hope you liked it"
        },
        {
            "name": "Linux",
            "level": "Intermediate",
            "icon": "/icons/linux-plain.svg",
            "text": "Linux, without a doubt when I changed from Windows to Linux (in this case it was Ubuntu) I improved a lot in terms of programming, Linux exposes you to technology, forces you to look for new things, new ways that are not comfortable, this is super essential for any developer. I like Ubuntu, Pop_OS and Mint, but they are all very good"
        },
        {
            "name": "Digital Ocean",
            "level": "Intermediate",
            "icon": "/icons/digitalocean-original.svg",
            "text": "DigitalOcean is like an AWS but more affordable as it is said on the official website is recommended for simple and medium sites, there many things need to be done by hand due to the lack of some services but an excellent corner to test several things"
        },
        {
            "name": "Bull",
            "level": "Intermediate",
            "icon": "/icons/bull.svg",
            "text": "Bull is a queue scheme that I learned in my professional experiences, based on Redis, Bull is basically an SQS but opensource is very performative with differences between tasks that are being executed that give errors and those that are finished, which provide us with a very interesting asynchronicity of processes"
        },
        {
            "name": "gRPC",
            "level": "Beginner",
            "icon": "/icons/grpc.svg",
            "text": "When it is necessary to have some HTTP communication between microservices with low latency and performance, gRPC fits even more if it is in Golang, I am still studying and seeing the applications but beforehand I can simply say that it is very fast and standardization"
        }
    ]
}